{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ViTForImageClassification",
    "parent_library": "transformers.models.vit.modeling_vit"
  },
  "base_model_name_or_path": "google/vit-base-patch16-224",
  "bias": "lora_only",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 8,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": null
}